tap "apenngrace/vulkan"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Download with resuming and segmented downloading
brew "aria2"
# Build tooling for Clojure
brew "boot-clj"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: false
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# The Clojure Programming Language
brew "clojure"
# Cross-platform make
brew "cmake"
# Tool for browsing source code
brew "cscope"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Command-line tool to interact with exercism.io
brew "exercism"
# Asynchronous event library
brew "libevent"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Image manipulation library
brew "jpeg"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# TIFF library and utilities
brew "libtiff"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Multi-platform library for OpenGL applications
brew "glfw"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Build tool for Clojure
brew "leiningen"
# Intel RealSense D400 series and SR300 capture
brew "librealsense"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# YAML Parser
brew "libyaml"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Creates dependencies in makefiles
brew "makedepend"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# NCurses Disk Usage
brew "ncdu"
# Very basic terminfo library
brew "unibilium"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Highly capable, feature-rich programming language
brew "perl"
# Manage compile and link flags for libraries
brew "pkg-config"
# Stand-alone ClojureScript REPL
brew "planck"
# Optimizer for PNG files
brew "pngcrush"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# User interface to the TELNET protocol
brew "telnet"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
cask "hammerspoon"
cask "hyper"
cask "visual-studio-code"
cask "vulkan-sdk"
