cmake
cscope
ffmpeg
freetype
gcc
gdbm
gettext
gifsicle
git
gmp
go
hub
icu4c
imagemagick
isl
jemalloc
jpeg
lame
leiningen
libevent
libidn2
libmpc
libpng
libtermkey
libtiff
libtool
libunistring
libuv
libvterm
libyaml
libzip
lua
luajit
makedepend
mpfr
msgpack
ncdu
neovim
nginx
node
openssl
pcre
pcre2
perl
pkg-config
planck
pngcrush
python
python@2
readline
ripgrep
ruby
sqlite
thefuck
tig
tmux
tree
unibilium
vim
wget
x264
xvid
xz
yarn
