cmake
cscope
ffmpeg
gifsicle
git
go
hub
imagemagick
leiningen
lua
makedepend
ncdu
neovim
nginx
pkg-config
pngcrush
ripgrep
thefuck
tig
tmux
tree
vim
yarn
